app/controllers/api/day_performances_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def index

        if params[:traineeId].nil?
            @day_performances = @current_user.day_performances_through_days
        else
            trainee = User.find(params[:traineeId] )