app/controllers/api/days_controller.rb

SELECT "days".* FROM "days" WHERE "days"."user_id" = $1  [["user_id", 4]]
---
    def index

        @days = Day.where(user_id: @current_user.id)