app/controllers/api/exercises_controller.rb

    def create
        @exercise = Exercise.new(exercise_params)
        @exercise.user_id = current_user.id

        if @exercise.save
---
INSERT INTO "exercises" ("name", "rest_time", "repetitions", "sets", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["rest_time", 0], ["repetitions", 0], ["sets", 0], ["user_id", 3], ["created_at", "2020-12-22 04:09:04.311304"], ["updated_at", "2020-12-22 04:09:04.311304"]]

    def index
        @exercises = Exercise.where(user_id: @current_user.id)
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 AND "exercises"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 0], ["LIMIT", 1]]

    def show
        @exercise = current_user.exercises.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 AND "exercises"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 1], ["LIMIT", 1]]

    def update
        @exercise = current_user.exercises.find(params[:id])
        if @exercise.update(exercise_params)
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 AND "exercises"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 0], ["LIMIT", 1]]
UPDATE "exercises" SET "name" = $1, "updated_at" = $2 WHERE "exercises"."id" = $3  [["name", "donenot "], ["updated_at", "2020-12-23 04:29:02.790248"], ["id", 37]]

    def destroy
        @exercise = current_user.exercises.find(params[:id])
        @exercise.destroy
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 AND "exercises"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 0], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 5]]

    def import
        tempfile = params['file'].tempfile
        datasheet = Roo::Spreadsheet.open(tempfile)
        headers = datasheet.row(1) #get header row


        datasheet.each_with_index do |row, idx|
            next if idx == 0 # skip header
            # create hash from headers and cells
            data = Hash[[headers, row].transpose]

            puts data

            exercise_data = {
                name: data['exercise_name'],
                description: data['description'],
                user_id: params[:trainer_id]
            }

            if Exercise.exists?(name: exercise_data[:name], user_id: params[:trainer_id])
                # puts "Exercise with name '#{exercise_data[:name]}' already exists"
                # next

                exercise = Exercise.find_by(name: exercise_data[:name])
            else
                #how does rails/db handle new if it already exists?
                exercise = Exercise.new(exercise_data)
                exercise.save!
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."name" = $1 LIMIT $2  [["name", "Castor canadensis"], ["LIMIT", 1]]
SELECT  1 AS one FROM "exercises" WHERE "exercises"."name" = $1 AND "exercises"."user_id" = $2 LIMIT $3  [["name", "Castor canadensis"], ["user_id", 49], ["LIMIT", 1]]
INSERT INTO "exercises" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "MUtLq"], ["description", "SiHIQGajxQP"], ["user_id", 28], ["created_at", "2021-01-11 00:43:00.702482"], ["updated_at", "2021-01-11 00:43:00.702482"]]

                user_id: params[:trainee_id]
            }

            if Performance.exists?(
                sets: performance_data[:sets],
                repetitions: performance_data[:repetitions],
                rest_time: performance_data[:rest_time],
                duration: performance_data[:duration],
                weight: performance_data[:weight],
                user_id: params[:trainee_id]
                )
---
SELECT  "performances".* FROM "performances" WHERE "performances"."sets" = $1 AND "performances"."repetitions" = $2 AND "performances"."rest_time" = $3 AND "performances"."duration" = $4 AND "performances"."weight" = $5 AND "performances"."user_id" = $6 LIMIT $7  [["sets", 49946], ["repetitions", 9], ["rest_time", 3306], ["duration", 14], ["weight", 1], ["user_id", 53], ["LIMIT", 1]]
SELECT  1 AS one FROM "performances" WHERE "performances"."sets" = $1 AND "performances"."repetitions" = $2 AND "performances"."rest_time" = $3 AND "performances"."duration" = $4 AND "performances"."weight" = $5 AND "performances"."user_id" = $6 LIMIT $7  [["sets", 49946], ["repetitions", 9], ["rest_time", 3306], ["duration", 14], ["weight", 1], ["user_id", 53], ["LIMIT", 1]]

                )
            else
                performance = Performance.new(performance_data)
                performance.save!
---
INSERT INTO "day_performances" ("performance_id", "day_id") VALUES ($1, $2) RETURNING "id"  [["performance_id", 54], ["day_id", 39]]
INSERT INTO "performances" ("duration", "weight", "rest_time", "repetitions", "sets", "exercise_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

                user_id: params[:trainee_id]
            }

            if Day.exists?(name: day_data[:name], user_id: params[:trainee_id])
---
SELECT  "days".* FROM "days" WHERE "days"."name" = $1 AND "days"."user_id" = $2 LIMIT $3  [["name", "Bitwolf"], ["user_id", 53], ["LIMIT", 1]]
SELECT  1 AS one FROM "days" WHERE "days"."name" = $1 AND "days"."user_id" = $2 LIMIT $3  [["name", "Wrapsafe"], ["user_id", 53], ["LIMIT", 1]]

                day = Day.find_by(name: day_data[:name], user_id: params[:trainee_id])
            else
                day = Day.new(day_data)
                day.save!
---
INSERT INTO "days" ("name", "user_id") VALUES ($1, $2) RETURNING "id"  [["name", "Wrapsafe"], ["user_id", 32]]

                day_id: day.id
            }

            if DayPerformance.exists?(
                performance_id: performance.id,
                day_id: day.id,
            )
---
SELECT  "day_performances".* FROM "day_performances" WHERE "day_performances"."performance_id" = $1 AND "day_performances"."day_id" = $2 LIMIT $3  [["performance_id", 90], ["day_id", 73], ["LIMIT", 1]]
SELECT  1 AS one FROM "day_performances" WHERE "day_performances"."performance_id" = $1 AND "day_performances"."day_id" = $2 LIMIT $3  [["performance_id", 54], ["day_id", 39], ["LIMIT", 1]]