app/controllers/api/performances_controller.rb

INSERT INTO "performances" ("duration", "weight", "rest_time", "repetitions", "sets", "exercise_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @performance = Performance.new(performance_params)
        if @performance.save

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "day_performances".* FROM "day_performances" INNER JOIN "days" ON "day_performances"."day_id" = "days"."id" WHERE "days"."user_id" = $1  [["user_id", 26]]
SELECT "performances".* FROM "performances" WHERE "performances"."user_id" = $1  [["user_id", 11]]
---
    def index

        unless params[:exercise].nil?
            exercise = Exercise.find(exercise_params[:id])
            @performances = exercise.performances

        else

            @performances = Performance.where(user_id: @current_user.id)