app/controllers/api/users_controller.rb

  def index

    @users = User.where(trainer_id: current_user.id)
---
SELECT "users".* FROM "users" WHERE ("users"."trainer_id" = $1 OR "users"."id" = $2)  [["trainer_id", 3], ["id", 3]]

  def update
    debugger
    @user = User.find(params[:id])
    if @user.update({trainer_id: params[:user][:trainer_id]})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
UPDATE "users" SET "trainer_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["trainer_id", 2], ["updated_at", "2021-01-18 22:35:19.953624"], ["id", 1]]

  def show
    # return the trainer
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]